In [13]:
import pandas as pd

Q1. List any five functions of the pandas library with execution.

In [14]:
A = [1,2,3,4,5,6,7,8,9,10]

In [15]:
print(A)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [16]:
df = pd.DataFrame(A)

In [17]:
df.head()

   0
0  1
1  2
2  3
3  4
4  5

In [18]:
df.tail()

    0
5   6
6   7
7   8
8   9
9  10

In [19]:
df.describe()

              0
count  10.00000
mean    5.50000
std     3.02765
min     1.00000
25%     3.25000
50%     5.50000
75%     7.75000
max    10.00000

In [20]:
df.dtypes

0    int64
dtype: object

In [21]:
df.columns

RangeIndex(start=0, stop=1, step=1)

Q.2 Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [22]:
data = { "column_1" : [1,2,3,4,5,6 ],
        "column_2": [12,12,13,14,14,19]

}

index = ['a','b','c','d','e','f']

In [23]:
df = pd.DataFrame(data, index)

In [24]:
df

   column_1  column_2
a         1        12
b         2        12
c         3        13
d         4        14
e         5        14
f         6        19

In [25]:
A = []

In [26]:

def reindex_dataframe(df):
    df.reset_index(drop=True, inplace=True)
    df.index = (df.index * 2) + 1
    return df

In [27]:
df = pd.DataFrame({'A': [10, 20, 30], 'B': [40, 50, 60], 'C': [70, 80, 90]})

# Reindex the DataFrame
new_df = reindex_dataframe(df)
print(new_df)

    A   B   C
1  10  40  70
3  20  50  80
5  30  60  90

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [49]:
d = { "Value": [1,2,3,4,5,6,7,8,9,10]}

In [50]:
df = pd.DataFrame(d)

In [53]:

def calculate_sum_of_first_three(df):
    values_column = df['Value']  # Access the 'Values' column
    sum_of_first_three = sum(values_column[0:3])  # Calculate the sum of the first three values
    print("Sum of the first three values:", sum_of_first_three)

calculate_sum_of_first_three(df)

Sum of the first three values: 6

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [68]:
data1 = {"Text": [" Pandas DataFrame", "Python function to", "contains the number of words in each row of the 'Text", "Given a Pandas DataFrame df with a column 'Text', write"]
    }

In [69]:
df6 = pd.DataFrame(data1)

In [70]:
df6

                                                Text
0                                   Pandas DataFrame
1                                 Python function to
2  contains the number of words in each row of th...
3  Given a Pandas DataFrame df with a column 'Tex...

In [76]:
df6['word_count'] = df6['Text'].apply(lambda x :len(x.split()))

In [72]:
df6

                                                Text  word_count
0                                   Pandas DataFrame           2
1                                 Python function to           3
2  contains the number of words in each row of th...          11
3  Given a Pandas DataFrame df with a column 'Tex...          10

How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size():

DataFrame.size returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns. It counts all the cells in the DataFrame, regardless of whether they contain data or are empty.
The output of DataFrame.size is a single integer value.
DataFrame.shape():

DataFrame.shape returns a tuple that represents the dimensions of the DataFrame. The tuple contains two elements: the number of rows and the number of columns, respectively.
The output of DataFrame.shape is a tuple of the form (rows, columns).

Q4 Which function of pandas do we use to read an excel file?


In pandas, you can use the pandas.read_excel() function to read an Excel file.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [86]:
df7 = pd.DataFrame({'email':['aaa@gmail.com','bbb@yahoo.com', 'ccc@aol.com']})

In [87]:
df7["user_name"] = df7["email"].apply(lambda x: x.split("@")[0])

In [88]:
df7

           email user_name
0  aaa@gmail.com       aaa
1  bbb@yahoo.com       bbb
2    ccc@aol.com       ccc

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [99]:
data_new = {"A" : [5,8,10,4,5,6,7],
            "B" : [3,4,19,40,50,60,70],
            "C" : [30,4,198,40,570,640,7230]
           }

In [100]:
df_new = pd.DataFrame(data_new)

In [101]:
df_new

    A   B     C
0   5   3    30
1   8   4     4
2  10  19   198
3   4  40    40
4   5  50   570
5   6  60   640
6   7  70  7230

In [106]:
result = df_new.loc[(df_new["A"]>5) & (df_new["B"]<20)]

In [107]:
result

    A   B    C
1   8   4    4
2  10  19  198